app/controllers/items_controller.rb

  def create
    @item = current_user.items.build(item_params)
    if @item.save
---
INSERT INTO "items" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Item to do"], ["user_id", 11], ["created_at", "2016-06-14 00:54:25.715195"], ["updated_at", "2016-06-14 00:54:25.715195"]]

  def destroy
    @item = current_user.items.find(params[:id])
    if @item.destroy
---
SELECT  "items".* FROM "items" WHERE "items"."user_id" = ? AND "items"."id" = ? LIMIT 1  [["user_id", 11], ["id", 51]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 51]]